app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("body", "created_at", "item_id", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?)  [["body", "alkfasd"], ["created_at", "2015-04-18 08:22:24.611344"], ["item_id", 8], ["updated_at", "2015-04-18 08:22:24.611344"], ["user_name", "Hello"]]