app/controllers/items_controller.rb

INSERT INTO "items" ("code", "created_at", "subtitle", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["code", "blah"], ["created_at", "2015-04-18 01:21:33.442482"], ["subtitle", "duck"], ["title", "chicken"], ["updated_at", "2015-04-18 01:21:33.442482"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "code" = ?, "updated_at" = ? WHERE "items"."id" = 9  [["code", ")(*A"], ["updated_at", "2015-04-18 05:47:44.201900"]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)

SELECT  "items".* FROM "items"  WHERE "items"."id" = ? LIMIT 1  [["id", 9]]
SELECT "comments".* FROM "comments"  WHERE "comments"."item_id" = ?  [["item_id", 8]]
---
    def set_item
      @item = Item.find(params[:id])
      @comments = @item.comments.all